Repository: S1933/EcoIndex-Drupal-Module
Catalog: translations/ecoindex.*.po
Languages: fr

source: Image and animation management
fr: Gestion des images et animations

source: Optimize and generate images before importing them into the CMS
fr: Optimiser et générer les images avant importation dans le CMS

source: Use images to convey information
fr: Utiliser une image lorsqu'elle est porteuse d'information

source: Propose a text alternative
fr: Proposer une alternative textuelle

source: Limit animations
fr: Limiter les animations

source: Avoid animated GIFs
fr: Éviter les GIFs animés

source: Avoid carousels (avoid automatic scrolling)
fr: Éviter les carrousels (bannir le défilement automatique)

source: Use instant changes rather than animated changes (Javascript)
fr: Privilégier les changements instantanés plutôt qu’animés (Javascript)

source: Prefer pagination to infinite scrolling
fr: Préférer la pagination au défilement infini

source: Video and sound management
fr: Gestion des vidéos et des sons

source: Ban video backgrounds
fr: Bannir les fonds vidéos

source: Use video or audio content when it conveys information
fr: Utiliser un contenu vidéo ou audio lorsqu'il est porteur d'information

source: Avoid automatic playback and loading of videos and sounds
fr: Éviter la lecture et le chargement automatique des vidéos et des sons

source: Adapt videos and sounds to reading contexts (size and definition)
fr: Adapter les vidéos et les sons aux contextes de lecture (taille et définition)

source: Offer a text alternative
fr: Proposer une alternative textuelle

source: Offer a 'listen only' mode for videos
fr: Proposer un mode 'écoute seule' pour les vidéos

source: Document management
fr: Gestion des documents

source: Compress and optimize documents
fr: Compresser et optimiser les documents

source: Provide document summaries
fr: Fournir un résumé des documents

source: Provide information on file size and format for downloading
fr: Informer sur le poids et le format des fichiers à télécharger

source: Link management
fr: Gestion des liens

source: Check that destination urls are valid
fr: Vérifier que les urls de destination sont bien valides
